aback:interloqué
abacterial:abactérienne
abacus:boulier
abacuses:abaques
abaft:sur l'arrière
abalone:ormeau
abalones:ormeaux
abandoned:abandon
abandonee:abandonée
abandoners:abandonneurs
abandoning:abandon
abandonment:abandon
abandonments:abandon
abandons:abandonne
abasement:abaissement
abasements:abaissements
abases:rabaisse
abasing:ignominieux
abated:apaisée
abatement:abattement
abatements:abattement
abater:dispositif antipollution
abates:s'apaise
abating:essoufflement
abbacies:abbayes
abbacy:abbaye
abbatial:abbatiale
abbe:abbé
abbess:abbesse
abbey:abbaye
abbeys:abbayes
abbot:abbé
abbots:abbés
abbotship:abbatiat
abbreviate:abréger
abbreviated:abrégé
abbreviates:abrège
abbreviating:abréviation
abbreviation:abréviation
abbreviations:abréviations
abbreviators:abréviateurs
abbreviatory:abréviatif
abdicate:abdiquer
abdicated:abdiqué
abdicates:abdique
abdicating:abdiquer
abdicators:abdicateurs
abdomens:abdomen
abdominal:abdominale
abdominally:abdomen
abdominals:abdominaux
abdominoplasty:abdominoplastie
abducens:abducteur
abduct:enlever des
abducted:enlèvement
abductee:abducté
abductees:enlevées
abducting:enlèvement
abduction:enlèvement
abductions:enlèvement
abductor:ravisseur
abductors:ravisseurs
abducts:abduction
aberrance:aberration
aberrances:synonyme d'aberration
aberrancies:aberrations
aberrancy:aberration
aberrantly:aberrante
aberrated:aberration
aberrating:aberratrice
aberrational:aberration
abet:complices
abetment:complicité
abets:se rend complice
abetted:encouragé
abetter:complice
abetting:complicité
abettor:complice
abettors:fauteurs
abeyance:suspens
abhor:horreur
abhorred:abhorré
abhorrence:horreur
abhorrent:odieuse
abhorrently:odieusement
abhorring:objet d'horreur
abhors:horreur
abidance:obéissance
abide:demeurez
abided:respectées
abides:demeure
abiding:respectueux
abidings:placements de l'
abigail:soubrette
abilities:capacité
ability:aptitude
abiological:abiologique
abiotic:abiotiques
abiotically:abiotique
abject:abjecte
abjectly:abjecte
abjectness:abjection
abjects:abjet
abjurations:abjuration
abjure:abjurer
abjured:abjuré
abjures:abjure
abjuring:abjuration
ablate:ablation
ablated:ablation
ablates:ablation
ablating:ablation
ablative:ablatif
ablatively:ablation
ablatives:ablatifs
ablator:ablateur
ablators:ablateurs
ablaze:feu
able:mesure
ableism:capacitisme
abler:habile
ablest:habile
abloom:fleuries
ably:habilement
abnegate:abdiqué
abnegated:abnégation
abnegating:abnégation
abnegation:abnégation
abnegations:abnégations
abnormal:anomalie
abnormalities:anomalie
abnormality:anomalie
abnormally:anormalement
abnormals:anormaux
abnormity:anomalie
aboard:bord
abode:demeure
abodes:demeures
aboideaux:aboiteaux
abolish:abolir
abolished:abolie
abolishers:abolisseurs
abolishes:abolit
abolishing:abolition
abolishment:abolition
abolishments:abolitions
abolitionism:abolitionnisme
abolitionist:abolitionniste
abolitionists:abolitionnistes
abomasal:caillette
abomasum:caillette
abominably:abominablement
abominated:abominé
abominates:abomination
aboriginal:autochtone
aboriginalism:autochtonisme
aboriginality:aboriginalité
aborigine:aborigène
aborigines:aborigènes
abort:abandon
aborted:avorté
abortee:avortée
aborters:avorteurs
abortifacient:abortif
abortifacients:abortifs
aborting:abandon
abortion:avortement
abortionist:avorteur
abortionists:avortement
abortions:avortement
abortive:abortif
aborts:avorte
abortuses:foetus avortés
aboulia:aboulie
aboulic:aboulique
abound:abondance
abounded:abondaient
abounding:foisonnant
abounds:abonde
about:sujet
above:au-dessus
aboveground:hors-sol
abradable:abrasible
abrade:abraser
abraded:abrasée
abrader:abrasion
abraders:polissoirs
abrades:abrase
abrading:abrasion
abrasive:abrasif
abrasively:abrasif
abrasiveness:abrasivité
abrasives:abrasifs
abreact:abréagir
abreaction:abréaction
abreactions:abréactions
abreactive:abréactif
abreast:courant
abridge:abréger
abridged:version abrégée
abridgement:abrégé
abridgements:abrégés
abridger:abréviateur
abridgers:abréviateurs
abridges:abrège
abridging:abrégeant
abridgment:abrégé
abridgments:abrégés
abroad:étranger
abrogate:abroger
abrogated:abrogée
abrogates:effet de porter
abrogating:abrogeant
abrogative:abrogatif
abrogator:abrogateurs
abrupt:brusque
abruption:décollement
abruptly:abruptement
abruptness:brusquerie
abscess:abcès
abscessed:abcès
abscesses:abcès
abscise:abscisse
abscised:abscisé
abscises:abscisses
abscising:abscission
absciss:abscisse
abscissa:abscisse
abscissae:abscisses
abscissas:abscisses
abscond:fuite
absconded:évadé
absconder:fugitif
absconders:fugueurs
absconding:fuite
absconds:s'évade
abseil:rappel
abseiled:corde double
abseiling:rappel
abseils:rappels
absented:absentés
absentee:absent
absenteeism:absentéisme
absentees:absents
absenting:absentement
absently:distraitement
absentminded:distrait
absentmindedly:distraitement
absinth:absinthe
absinthism:absinthisme
absinths:absinthes
absolute:absolue
absolutely:absolument
absoluteness:absolu
absolutes:absolu
absolutise:absolutiser
absolutised:absolutisé
absolutises:absolutise
absolutising:absolutisation
absolutism:absolutisme
absolutisms:absolutisme
absolutist:absolutiste
absolutistic:absolutiste
absolutists:absolutistes
absolutize:absolutiser
absolutized:absolutisé
absolutizes:absolutise
absolutizing:absolutisation
absolve:absoudre
absolved:absous
absolves:absout
absolving:absolution
absorb:absorber
absorbability:capacité d'absorption
absorbances:absorbance
absorbancies:spectromètre
absorbancy:absorbance
absorbate:absorbat
absorbates:absorbats
absorbed:absorbée
absorbefacient:résorbant
absorbencies:absorptivités
absorbency:absorbance
absorbent:absorbant
absorbents:absorbants
absorber:absorbeur
absorbers:absorbeurs
absorbing:absorption
absorbs:absorbe
absorptance:coefficient d'absorption
absorptiometer:absorptiomètre
absorptive:absorption
absorptivities:absorptivités
absorptivity:absorptivité
abstain:s'abstiennent
abstained:abstenus
abstainer:abstentionniste
abstainers:abstentionnistes
abstaining:abstention
abstains:s'abstient
abstemious:sobre
abstemiously:sobrement
abstemiousness:sobriété
abstentionism:abstentionnisme
abstentionist:abstentionniste
abstentionists:abstentionnistes
abstract:résumé
abstractable:extractible
abstracted:abstraite
abstractedly:abstraction
abstracters:abstracteurs
abstracting:abstraction
abstractionism:abstraction
abstractionists:abstraits
abstractive:abstraction
abstractively:abstractivement
abstractly:abstraitement
abstractness:abstraction
abstractors:abstracteurs
abstracts:résumé
abstruseness:hermétisme
absurd:absurde
absurdest:absurdes
absurdist:absurde
absurdities:absurdités
absurdity:absurdité
absurdly:absurdement
absurdness:absurdité
abulia:aboulie
abulias:aboulies
abulic:aboulique
abuna:abouna
abundance:abondance
abundances:abondance
abundancies:abondances
abundant:abondante
abundantly:abondance
abuse:abus
abused:victime de violence
abuser:agresseur
abusers:des agresseurs
abuses:abus
abusing:abuser
abusively:abusivement
abusiveness:caractère abusif
abut:butée
abutment:butée
abutments:culées
abuts:butée
abutted:aboutement
abutting:butée
abuzz:effervescence
abysm:abîme
abysmal:abyssale
abysmally:lamentablement
abysms:abîmes
abyss:abîme
abyssopelagic:abyssopélagique
academe:universitaire
academia:universitaire
academic:universitaire
academical:académique
academically:académiquement
academician:académicien
academicians:académiciens
academicism:académisme
academicisms:académismes
academics:des universitaires
academies:académies
academism:académisme
academists:académiciens
academy:académie
acalculia:acalculie
acanthi:acanthes
acanthocephalan:acanthocéphale
acanthus:acanthe
acanthuses:acanthes
acarian:acarien
acariasis:acariose
acaricidal:acaricide
acarid:acarien
acarids:acariens
acarines:acariens
acarodomatia:acarodomaties
acarology:acarologie
acca:l'ACCA
accable:accablé
accede:adhèrent
acceded:adhéré à l'Union
accedes:adhère
acceding:adhérents
accelerant:accélérateur
accelerants:accélérateurs
accelerate:accélèrent
accelerated:accélération
accelerates:accélère
accelerating:accélération
acceleration:accélération
accelerations:accélérations
accelerative:accélérateur
accelerator:accélérateur
accelerators:accélérateurs
acceleratory:accélératoire
accelerometer:accéléromètre
accelerometers:accéléromètres
accented:accentués
accenting:accentuation
accentless:sans accent
accents:accent
accentuate:accentuer
accentuated:accentuation
accentuates:s'accentue
accentuating:accentuation
acceptabilities:acceptabilités
acceptability:acceptabilité
acceptable:niveau acceptable
acceptably:manière acceptable
acceptance:acceptation
acceptances:acceptations
acceptant:acceptante
acceptations:acceptions
accepted:acceptée
accepter:accepteur
accepting:acceptation
acceptor:accepteur
acceptors:accepteurs
accepts:accepte
access:accès
accessaries:complices
accessary:complice
accessed:accès
accesses:accès
accessibilities:accessibilités
accessibility:accessibilité
accessibly:accessiblement
accessing:accédant
accession:adhésion
accessions:adhésions
accessories:des accessoires
accessorily:accessoirement
accessorised:accessoirisée
accessorized:accessoirisé
accessorizes:accessoirise
accessorizing:accessoirisation
accessory:accessoire
accidental:altération
accidentality:accidentalité
accidentally:accident
accidentalness:accidentalité
accidentals:altérations
accidented:accidenté
accidently:accidentellement
accidentology:accidentologie
accidents:accident
accipitral:accipitrine
acclaim:succès
acclaimed:renommée
acclaiming:acclamant
acclaims:acclame
acclimate:s'acclimater
acclimated:acclimatée
acclimates:s'acclimate
acclimating:acclimatation
acclimation:acclimatation
acclimatisation:acclimatation
acclimatise:acclimatation
acclimatised:acclimaté
acclimatising:acclimatation
acclimatization:acclimatation
acclimatized:acclimaté
acclimatizes:s'acclimate
acclimatizing:acclimatation
acclivities:pentes
acclivity:escarpement
accoladed:accolade
accolades:distinctions
accommodate:accommoder
accommodated:logés
accommodates:loge
accommodating:logement
accommodation:hébergement
accommodations:hébergement
accommodative:accommodante
accommodator:conciliateur
accommodators:hébergeurs
accompanied:compagnie
accompanier:accompagnateur
accompaniers:accompagnateurs
accompanies:accompagne
accompaniment:accompagnement
accompaniments:accompagnements
accompanist:accompagnateur
accompanists:accompagnateur
accompany:accompagnement
accompanying:accompagnement
accompanyist:accompagnateur
accomplice:complice
accomplices:complices
accomplish:accomplir
accomplished:accomplie
accomplisher:qui accomplit
accomplishes:accomplit
accomplishing:accomplissement
accomplishment:accomplissement
accomplishments:réalisations
accordance:fonction
accordances:concordances
accordant:concordants
accorded:accordé
according:fonction
accordingly:conséquence
accordion:accordéon
accordionist:accordéoniste
accordionists:accordéonistes
accordions:accordéons
accost:accoster
accosted:accostés
accosting:accostage
accosts:accoste
account:compte
accountability:responsabilisation
accountable:responsable
accountably:manière responsable
accountancies:comptabilités
accountancy:comptabilité
accountant:comptable
accountants:comptable
accounted:comptabilisés
accounting:comptabilité
accountings:comptabilités
accounts:des comptes
accoutered:accoutrement
accouterment:accoutrement
accouterments:accoutrements
accoutred:accoutré
accredit:accréditer
accreditation:accréditation
accreditations:accréditations
accredited:organisme accrédité
accrediting:accréditation
accredits:accrédite
accrescent:accrescents
accreted:accrétion
accretes:accrétion
accreting:accrétion
accretion:relution
accretionary:accrétion
accretions:accumulations
accretive:effet relutif
accrual:exercice
accruals:régularisation
accrue:sont dévolus
accrued:régularisation
accrues:s'y accumulent
accruing:revenant
acculturate:acculturation
acculturated:acculturés
acculturates:acculture
acculturating:acculturation
acculturative:acculturation
accumulable:cumulables
accumulate:s'accumulent
accumulated:cumul
accumulates:s'accumule
accumulating:accumulation
accumulative:accumulation
accumulatively:cumulativement
accumulator:accumulateur
accumulators:accumulateurs
accuracies:précision
accuracy:précision
accurate:précision
accurately:précision
accurateness:exactitude
accursed:maudite
accurst:maudite
accusative:accusatif
accusatives:accusatifs
accusatorial:accusatoire
accusatory:accusatrice
accuse:accuser
accused:accusé
accuser:accusateur
accusers:accusateurs
accuses:accuse
accusing:accusé
accusingly:accusateur
accustom:habituer
accustomed:habitué
accustoming:accoutumance
accustoms:habitue
ace:as
acedia:acédie
acellular:acellulaire
acentric:acentrique
acephalic:acéphale
acephalous:acéphale
acerbate:exacerber
acerbates:exacerbe
acerbic:acerbe
acerbically:ton acerbe
acerbity:aigreur
acervuli:acervules
acervulus:acervule
aces:as
aceta:acétate de méthyle
acetabular:cotyle
acetabulum:cotyle
acetal:acétal
acetaldehyde:acétaldéhyde
acetaldehydes:acétaldéhydes
acetals:acétals
acetamid:acétamide
acetamide:acétamide
acetamides:acétamides
acetaminophen:acétaminophène
acetaminophens:acétaminophène
acetanilide:acétanilide
acetanilides:acétanilides
acetate:acétate
acetated:acidé
acetates:acétates
acetazolamide:acétazolamide
acetic:acétique
acetification:acétification
acetified:acétifié
acetin:acétine
acetonaemia:acétonémie
acetone:mélange acétone
acetonemia:acétonémie
acetones:acétones
acetonitrile:mélange acétonitrile
acetonitriles:acétonitriles
acetoxyl:acétoxyle
acetyl:groupe acétyle
acetylate:acétylate
acetylated:acétyle
acetylates:acétyle
acetylating:acétylation
acetylation:acétylation
acetylations:acétylations
acetylcholine:acétylcholine
acetylene:acétylène
acetylenes:acétylènes
acetylenic:acétylénique
acetylides:acétylures
acetyls:acétyls
acetylsalicylic:acétylsalicylique
achalasia:achalasie
ache:douleur
ached:avait mal
achene:akène
achenes:akènes
aches:courbatures
achievable:réalisable
achieve:réalisation
achieved:atteints
achievement:exploit
achievements:succès
achiever:réalisateur
achievers:performants
achieves:réalise
achieving:réalisation
aching:douloureux
achiote:roucou
achiral:achirale
achlorhydric:achlorhydriques
achondroplasia:achondroplasie
achromatic:achromatique
achromatically:achromatiquement
achromatization:achromatisation
achromatized:achromatique
achromatizing:achromatisation
achromatous:achrome
achromic:achromiques
achy:d'malaise
acicular:aciculaire
acid:acide
acidemia:acidose
acidemias:acidémies
acidic:acide
acidified:acidifié
acidifier:acidifiant
acidifiers:acidifiants
acidifies:acidifie
acidify:acidifier
acidifying:acidifiant
acidimeters:acidimètres
acidimetric:acidimétrie
acidimetrically:acidimétrie
acidimetry:acidimétrie
acidities:acidités
acidity:acidité
acidly:ton acide
acidometer:acidomètre
acidophil:acidophiles
acidophilic:acidophiles
acidophilous:acidophiles
acidophils:acidophiles
acidosis:acidose
acidotic:acidose
acids:acides
acidulated:acidulée
acidulating:acidifiant
acidulation:acidification
acidulous:acidulée
acidurias:aciduries
acinar:acinaire
acinic:acineuses
ackee:akée
acknow:recon
acknowledge:accusé de réception
acknowledged:reconnu
acknowledgement:accusé de réception
acknowledges:reconnaît
acknowledging:reconnaissance
acknowledgment:accusé de réception
acknowledgments:remerciements
aclinic:aclinique
acme:comble
acne:acné
acned:acnéiques
acnode:point conjugué
acoelomate:acoelomates
aconite:aconit
acorn:gland
acorns:glands
acosmism:acosmisme
acoustic:acoustique
acoustical:acoustique
acoustically:acoustique
acoustician:acousticien
acousticians:acousticiens
acoustics:acoustique
acquaint:connaissance
acquaintance:connaissance
acquaintances:connaissances
acquainted:connaissance
acquainting:familiarisant
acquaints:familiarise
acquest:acquêts
acquests:acquêts
acquiesced:acquiescé
acquiescence:acquiescement
acquiescences:acquiescements
acquiescent:acquiescement
acquiesces:acquiesce
acquiescing:acquiescement
acquire:acquisition
acquired:acquis
acquiree:entreprise acquise
acquirees:sociétés acquises
acquirement:acquisition
acquirements:acquisitions
acquirer:acquéreur
acquirers:acquéreurs
acquires:acquiert
acquiring:acquisition
acquisitional:acquisitionnelle
acquisitiveness:avidité
acquittal:acquittement
acquittals:acquittement
acquittance:quittance
acquittances:quittance
acquitted:acquitté
acquitting:acquittement
acratic:acratique
acreage:superficie
acreages:superficies
acres:hectares
acrid:âcre
acridity:âcreté
acridness:âcreté
acriflavin:acriflavine
acrimonious:acrimonieuse
acrimoniously:acrimonie
acrimony:acrimonie
acritarch:acritarches
acritarchs:acritarches
acritical:acritique
acrobat:acrobate
acrobatic:acrobatique
acrobatically:acrobatique
acrobatics:acrobatie
acrobatism:acrobatie
acrobats:acrobates
acrocarpous:acrocarpe
acrocentric:acrocentrique
acrocentrics:acrocentriques
acrogens:acrogènes
acrolect:acrolecte
acrolein:acroléine
acroleins:acroléines
acrolith:acrolithe
acrolithic:acrolithe
acromegalic:acromégalique
acromegalics:acromégalie
acromegaly:acromégalie
acromia:acromions
acronym:acronyme
acronyms:acronymes
acroparesthesia:acroparesthésies
acropetal:acropète
acrophobia:acrophobie
acrophonic:acrophonique
acropolis:acropole
acropolises:acropole
across:ensemble
acrostic:acrostiche
acrostics:acrostiches
acroter:acrotère
acroteria:acrotères
acroterion:acrotère
acroterium:acrotère
acroteriums:acrotères
acroters:acrotères
acrylic:acrylique
acrylics:des acryliques
acrylonitrile:copolymère acrylonitrile
act:acte
acted:agi
actin:actine
acting:action
actings:intérimaires
actinians:actinies
actinias:actinies
actinic:actinique
actinically:actiniquement
actinism:actinisme
actinolites:actinotes
actinometer:actinomètre
actinometers:actinomètres
actinometric:actinométrique
actinometry:actinométrie
actinomorphic:actinomorphe
actinomycetes:actinomycètes
actinomycetous:actinomycètes
actinomycins:actinomycines
actinomycosis:actinomycose
actinomycotic:actinomycosique
actinotherapy:actinothérapie
actionable:action
actioned:actionnées
actioner:film d'action
actioning:actionnant
actionist:actioniste
actionists:actionistes
actionless:sans action
actions:action
activated:actif
activates:active
activating:activateur
activator:activateur
activators:activateurs
active:actif
actively:active
activeness:dynamisme
activism:activisme
activisms:activismes
activist:militant
activistic:activiste
activists:militants
activities:des activités
activity:activité
actomyosin:actomyosine
actor:acteur
actors:des acteurs
actress:actrice
actresses:des actrices
acts:des actes
actual:réelle
actualise:actualiser
actualised:actualisée
actualises:actualise
actualising:actualisante
actualist:actualiste
actualities:actualités
actuality:réalité
actualization:actualisation
actualizations:actualisations
actualize:actualiser
actualized:actualisée
actualizes:actualise
actualizing:actualisation
actually:réalité
actuals:réels
actuarial:évaluation actuarielle
actuarially:base actuarielle
actuaries:actuaires
actuary:actuaire
actuate:actionner
actuated:actionnement
actuates:actionne
actuating:actionnement
actuation:actionnement
actuations:manoeuvres
actuator:actionneur
actuators:actionneurs
acuities:acuité
acuity:acuité
aculeate:aculée
aculeus:aiguillon
acumen:sens aigu
acuminate:acuminés
acuminated:acuminées
acupoint:point d'acupuncture
acupoints:points d'acupuncture
acupressures:acupressions
acupunctural:acupuncturale
acupunctures:acuponctures
acupuncturist:acupuncteur
acupuncturists:acupuncteurs
acute:maladie aiguë
acutely:acuité
acuteness:acuité
acyclic:acyclique
acyl:groupe acyle
acylated:acylé
acylating:acylation
acyloin:acyloïne
acyloins:acyloïnes
ad:annonce
adagios:adagio
adamant:diamant
adamantly:catégoriquement
adapt:s'adapter
adaptabilities:adaptabilités
adaptability:adaptabilité
adaptational:adaptatives
adapted:adaptation
adapter:adaptateur
adapters:adaptateur
adapting:adaptation
adaption:adaptation
adaptions:adaptations
adaptive:adaptatif
adaptively:adaptative
adaptiveness:adaptabilité
adaptivity:adaptabilité
adaptogen:adaptogène
adaptogenic:adaptogène
adaptogens:adaptogènes
adaptor:adaptateur
adaptors:adaptateur
adapts:s'adapte
add:complément
addable:cumulable
addaxes:addax
added:atout
addend:cumulateur
addends:opérandes
addendum:avenant
addendums:addenda
adder:additionneur
adders:additionneurs
addict:toxicomane
addicted:toxicomane
addicting:addictif
addiction:dépendance
addictions:toxicomanie
addictive:dépendance
adding:addition
additional:montant supplémentaire de
additionality:additionnalité
additionally:plus
additive:additif
additively:additive
additives:additif
additivity:additivité
addling:brasse
addorsed:adossés
address:adresse
addressability:adressabilité
addressable:adressable
addressed:adressée
addressee:destinataire
addressees:destinataires
addresser:destinateur
addresses:adresse
addressing:adressage
addressor:destinateur
adds:ajoute
adduced:mis en preuve
adducent:adducteur
adducer:entité fournissant
adduces:n'apporte
adduct:produit d'addition
adducted:produit d'addition
adducting:produit d'addition
adductor:adducteur
adductors:adducteurs
adducts:adduits
adenectomy:adénectomie
adenine:adénine
adenitis:adénite
adenocarcinoma:adénocarcinome
adenocarcinomas:adénocarcinomes
adenoid:adénoïdes
adenoidal:adénoïdes
adenoidectomies:adénoïdectomies
adenoidectomy:adénoïdectomie
adenoids:végétations adénoïdes
adenoma:adénome
adenomas:adénome
adenomata:adénome
adenomatous:adénomateuse
adenopathies:adénopathies
adenopathy:adénopathie
adenosine:adénosine
adenoviral:adénovirus
adenovirus:adénovirus
adenoviruses:adénovirus
adenyl:cyclase
adenylic:adénylique
adept:adepte
adepts:des adeptes
adequacies:adéquations
adequacy:adéquation
adequate:adéquate
adequately:manière adéquate
adequateness:adéquation
adherable:pouvant adhérer
adhere:adhérer
adhered:adhéré
adherence:adhésion
adherences:adhésions
adherend:adhérent
adherends:adhérées
adherent:adhérent
adherently:adhérente
adherents:adhérents
adheres:adhère
adhering:adhérent
adhesion:adhérence
adhesions:adhérences
adhesive:colle
adhesively:adhésif
adhesiveness:adhésivité
adhesives:adhésifs
adhocracies:adhocraties
adhocracy:structure ad hoc
adiabatic:adiabatique
adiabatically:adiabatique
adiabatics:adiabatiques
adieus:adieux
adipic:adipique
adipose:adipeux
adiposity:adiposité
adipous:adipeux
adipsia:adipsie
adjacencies:contiguïtés
adjacency:contiguïté
adjacent:côté
adjacently:côte à côte
adjectival:adjectif
adjectivally:adjectif
adjective:adjectif
adjectively:adjectivement
adjectives:adjectifs
adjoin:jouxtent
adjoining:voisine
adjoins:jouxte
adjourn:ajournement
adjourned:levée
adjourning:ajourner
adjournment:ajournement
adjournments:ajournement
adjourns:ajournement
adjudged:jugé
adjudging:adjugeant
adjudicated:adjugée
adjudicating:statuer
adjudication:arbitrage
adjudicative:arbitrage
adjudicator:arbitre
adjudicators:des arbitres
adjudicatory:juridictionnel
adjunct:complément
adjunction:adjonction
adjunctions:adjonctions
adjunctive:adjuvant
adjuncts:compléments
adjured:conjura
adjures:adjure
adjuring:adjurant
adjust:réglage
adjustability:réglage
adjustable:réglable
adjustably:réglable
adjusted:corrigé
adjuster:expert
adjusters:réglage
adjusting:dispositif de réglage
adjustment:ajustement
adjustments:ajustement
adjustor:ajusteur
adjustors:ajusteurs
adjusts:ajuste
adjutage:ajutage
adjutages:ajutages
adjutancy:adjudance
adjutant:adjudant
adjutants:adjudants
adult:adulte
advance:avance
advantage:avantage
adventurer:aventurier
adverb:adverbe
advert:annonce
advertise:publicité
advertisement:annonce
advertiser:annonceur
advertising:publicité
advice:avis
advisor:conseiller
aerial:antenne
aeroplane:avion
affair:affaire
affordable:prix abordable
agreement:accord
agrement:agrément
aid:aide
airfoil:profil aérodynamique
airport:aéroport
alien:étranger
allegory:allégorie
allergy:allergie
allotment:lotissement
allowance:allocation
ally:allié
alpinist:alpiniste
amazing:étonnante
amount:quantité
angel:ange
anger:colère
ankle:cheville
anniversary:anniversaire
announcement:annonce
anomaly:anomalie
answer:réponse
anthem:hymne
anxiety:anxiété
anything:rien
apologise:excuses
apology:des excuses
app:application
appearance:apparence
appearances:apparences
appeaser:conciliateur
appetite:appétit
apple:pomme
appliance:appareil
applicant:demandeur
appoint:nomination
appointment:rendez-vous
apprenticeship:apprentissage
approach:approche
approaching:approche
apron:tablier
arc:arc de cercle
arch:arche
architect:architecte
are:sont
area:surface
arena:arène
arm:bras
armadillo:tatou
armchair:fauteuil
armed:conflit armé
armpit:aisselle
aroma:arôme
array:tableau
arrival:arrivée
arrow:flèche
as:comme
ash:cendre
ashtray:cendrier
aspiring:aspirant
ass:âne
assembly:assemblée
asses:ânes
assess:éva
assessment:évaluation
asset:atout
assignment:mission
astronaut:astronaute
at:à
atheist:athée
athlete:athlète
attempt:tentative
attendant:accompagnateur
attic:grenier
attorney:avocat
audience:auditoire
aunt:tante
author:auteur
autobiography:autobiographie
aver:moyenne
average:moyenne
award:prix
away:écart
awesome:impressionnante
awful:terrible
babe:bébé
baccalaureate:baccalauréat
back:retour
backache:mal de dos
backdoor:porte dérobée
backhand:revers
backlash:jeu
backlog:carnet de commandes
backpack:sac à dos
bacon:lard
badger:blaireau
badly:mal
bag:sac
bagger:ensacheuse
bagging:ensachage
bailout:plde sauvetage
bake:cuisson
baker:boulanger
bakery:boulangerie
balanced:approche équilibrée
ball:boule
balloon:ballon
ballot:bulletin de vote
ban:interdiction
banana:banane
bananas:banane
band:bande
banner:bannière
bannister:rampe
bar:barre
barbeque:barbecue
bare:nu
bargain:bonne affaire
barn:grange
barred:prescription
barrel:tonneau
bass:basse
bast:libériennes
bat:chauve-souris
bath:bain
bathroom:salle de bains
batsman:batteur
batsmen:batteurs
batt:nappe
be:être
beach:plage
bead:bourrelet
bean:haricot
beanbag:pouf
beanie:bonnet
bear:ours
beard:barbe
beast:bête
beating:raclée
beautiful:belle
beauty:beauté
beaver:castor
bed:lit
bee:abeille
beer:bière
beetroot:betterave
began:commencé
beginner:débutant
being:étant
belief:croyance
believe:croient
bell:cloche
bellboy:chasseur
belligerent:belligérant
belt:courroie
bench:banc
benefit:avantage
beret:béret
berry:baie
berth:couchette
best:meilleure
bet:pari
beta:bêta
betrayal:trahison
better:meilleur
bias:biais
bib:bavoir
bibs:dossards
bicycle:bicyclette
bid:offre
big:gros
bigger:plus grand
bike:vélo
bill:projet de loi
billboard:panneau d'affichage
billion:milliard
billionaire:milliardaire
bin:bac
bind:impasse
binder:liant
biography:biographie
bird:oiseau
biro:stylo bille
bit:peu
bitch:chienne
bite:morsure
black:noir
blackmail:chantage
bland:fade
blanket:blanchet
blaring:tonitruante
blaze:incendie
bleach:agent de blanchiment
blender:mélangeur
blessing:bénédiction
blind:aveugle
blood:sang
bloodbath:bain de sang
bloodhound:limier
blowjob:pipe
blue:bleu
blueprint:plan
blunt:instrument contondant
board:conseil
boarder:pensionnaire
boat:bateau
bodyguard:garde du corps
boil:ébullition
bollocks:couilles
bolt:boulon
bomb:bombe
bond:lien
bone:os
book:livre
bookcase:bibliothèque
bookshelf:étagère
bookshop:librairie
boor:rustre
boot:botte
booth:stand
bor:frontière
border:frontière
bore:alésage
born:né
borough:arrondissement
botched:raté
bother:gêne
bottle:bouteille
bound:bond
boundary:frontière
bounty:prime
bow:archet
bowl:bol
bowls:bols
box:boîtier
boy:garçon
boyfriend:copain
bra:soutien-gorge
braggart:vantard
brainstorming:remue-méninges
brake:frein
branch:branche
brand:marque
brass:en laiton
breach:violation
bread:pain
breadwinner:soutien de famille
break:pause
breakdown:panne
bream:brème
breast:sein
breath:souffle
breathe:respirer
breathtaking:souffle
breed:race
breeder:éleveur
brew:infusion
bribe:pot de vin
bricklayer:maçon
bride:mariée
bridge:pont
brief:brève
briefcase:mallette
brig:brick
bright:brillant
brilliant:brillante
bristling:hérissée
broadcast:diffusion
broader:plus large
broom:balai
brother:frère
brow:front
brown:brun
brows:front
browse:parcours
browsed:naviguerez
browser:navigateur
bruise:ecchymose
bruising:ecchymose
brunette:brune
brunt:choc
brush:brosse
bubble:bulle
buck:mâle
bucket:seau
buckle:boucle
buddy:copain
budgie:perruche
build:accumulation
builder:constructeur
building:bâtiment
bulb:ampoule
bulbous:bulbe
bulge:renflement
bulk:nombre
bull:taureau
bullet:balle
bullfighting:corrida
bullied:victime d'intimidation
bully:tyran
bum:clochard
bump:bosse
bun:petit pain
bunch:groupe
bund:digue
bundle:faisceau
bunny:lapin
bur:fraise
burden:fardeau
burger:hamburger
burglar:cambrioleur
burglary:cambriolage
burn:brûlure
burnt:holocauste
burs:fraises
bursary:bourse
burst:rafale
business:entreprise
businessman:homme d'affaires
businesswoman:femme d'affaires
bust:buste
bustling:animé
busy:occupé
butcher:boucher
butler:majordome
butt:mégot
butterfly:papillon
buzzword:mot à lmode
by:par
bypass:by-pass
cab:taxi
cabbage:chou
cabin:cabine
cabinet:coffret
cafe:café
called:dite
calling:vocation
cam:came
camcorder:caméscope
camel:chameau
camera:caméra
campaign:campagne
campsite:camping
can:canette
canary:canari
candid:candide
candy:bonbon
cant:dévers
cap:couvercle
caption:légende
caravan:caravane
card:carte
care:charge
career:carrière
carnival:carnaval
carousel:carrousel
carpenter:charpentier
carpet:tapis
carriage:chariot
carrot:carotte
cart:panier
carter:charretier
case:boîtier
cashier:caissière
castle:château
cat:chat
catchment:bassin versant
catchphrase:slogan
caterpillar:chenille
cats:chat
cattle:bovin
cauldron:chaudron
cave:grotte
caveat:mise en garde
cavity:cavité
ceder:cèdre
cell:cellule
cellar:cave
census:recensement
certainty:certitude
chain:chaîne
chair:chaise
chairman:président
chal:défi
chalk:craie
challenge:défi
challenging:défi
chameleon:caméléon
chandelier:lustre
change:changement
char:chevalier
charact:caract
character:caractère
characteristic:caractéristique
chariot:char
charity:organisme de bienfaisance
chart:tableau
charwoman:femme de ménage
chase:course-poursuite
cheat:tricheur
check:chèque
checking:contrôle
cheetah:guépard
chemical:produit chimique
chemist:chimiste
chemistry:chimie
cherry:cerise
chest:coffre
chicken:poulet
child:enfant
chill:frisson
chilli:piment
chimney:cheminée
chin:menton
chinese:chinois
chip:puce
chipmunk:écureuil
chisel:ciseau
chocolate:chocolat
choice:choix
choir:chorale
chokehold:étranglement
chord:accord
chum:copain
chunk:morceau
circular:circulaire
citizen:citoyen
city:ville
clam:palourde
class:classe
classmate:camarade de classe
classroom:salle de classe
claw:griffe
cleaner:nettoyeur
clerk:commis
clever:astucieux
cliche:cliché
click:clic
cliff:falaise
climb:montée
cloak:manteau
clock:horloge
closet:placard
cloth:chiffon
clothes:des vêtements
cloud:nuage
cloudless:sans nuages
cloudy:trouble
clout:influence
coach:entraîneur
coalmine:mine de charbon
coaster:montagne
coat:couche
cockerel:coq
coffee:café
coffin:cercueil
cog:rouage
coil:bobine
coin:pièce de monnaie
cold:froid
collar:collier
college:collège
colliery:mine de charbon
colors:des couleurs
comb:peigne
combination:combinaison
combine:moissonneuse-batteuse
comedian:comédien
commercial:commerciale
commit:engagement
common:commune
community:communauté
commuter:banlieusard
comp:échantillon
company:société
comparison:comparateur
compelling:irrésistible
competence:compétence
competition:concours
component:composant
computer:ordinateur
concern:préoccupation
condom:préservatif
confer:conférence
conference:conférence
conflict:conflit
conjunction:liaison
connecting:connexion
connection:liaison
cons:contre
conservatory:véranda
consist:consistent
constituency:circonscription
consume:consomment
consumer:consommateur
container:récipient
contestant:concurrent
contra:contre
contract:contrat
contrast:contraste
controversial:controverse
convertible:cabriolet
conveyance:moyen de transport
convict:forçat
cook:cuisinier
cookbook:livre de cuisine
cooker:cuiseur
cooking:cuisson
cool:endroit frais
cop:flic
copybook:cahier
cord:corde
corker:type épatant
corner:coin
corporate:entreprise
corpse:cadavre
corresponding:l'correspondant
cost:coût
costly:coûteux
cot:lit de bébé
cottage:chalet
couch:canapé
cough:toux
count:comptage
counter:compteur
counters:compteurs
country:pays
coup:coup d'Etat
coupe:coupé
course:cours
court:tribunal
cove:crique
cover:couvercle
coverup:dissimulation
cow:vache
coward:lâche
cowardly:lâche
crab:crabe
cramp:crampe
crank:manivelle
crappy:merde
craw:jabot
craze:engouement
cream:crème
credit:crédit
creeper:plante grimpante
creepy:chair de poule
crest:crête
crew:équipe
crisis:crise
crisper:bac à légumes
critic:critique
critical:critique
crooked:croche
crop:récolte
cross:croix
crossing:passage
crossroad:carrefour
crotch:entrejambe
crow:corbeau
crowd:foule
crown:couronne
crude:brut
cruise:croisière
crumpet:crêpe
crumpled:froissé
crush:écrasement
crypt:crypte
cubed:cube
cucumber:concombre
cue:mémoire
culprit:coupable
cultural:culturel
cunning:ruse
cunt:chatte
cup:tasse
cupboard:armoire
cupcake:petit gâteau
cuppa:tasse de thé
cur:actu
cure:remède
curl:boucle
currency:monnaie
current:courant
curricula:cursus
curricular:programme d'études
curt:brusque
curtain:rideau
curve:courbe
curveball:mise en abyme
cushion:coussin
custard:crème anglaise
custom:coutume
customer:client
cut:coupe
cutback:fluidifié
cute:mignon
cutter:dispositif de coupe
dad:papa
daffodil:jonquille
daily:quotidien
dam:barrage
damned:damné
damp:chiffon humide
damper:amortisseur
dance:danse
dancer:danseuse
danish:danois
dare:défi
daredevil:casse-cou
dark:sombre
dart:fléchette
dash:tiret
dashing:fringant
daughter:fille
dawn:aube
day:jour
dazzling:éblouissant
dead:mort
deal:accord
dealer:concessionnaire
debacle:débâcle
debate:débat
debt:dette
decision:décision
deck:plate-forme
decline:baisse
decrease:diminution
deep:profonde
deer:cerf
defect:défaut
defence:défense
defi:défi
define:définition
defining:définition
degree:degré
delay:retard
delivery:prestation
demo:démo
demonstrator:démonstrateur
dental:dentiste
department:département
depict:dépeignent
deposit:dépôt
depressant:dépresseur
deprivation:privation
depth:profondeur
designer:concepteur
desire:désir
desk:bureau
deterioration:détérioration
deterrent:effet dissuasif
device:dispositif
dial:cadran
diamond:diamant
diaper:couche-culotte
diary:journal
dick:bite
die:filière
diet:alimentation
digit:chiffre
digital:convertisseur numérique
dim:faible
dimple:fossette
din:vacarme
dinner:dîner
dip:plongeon
diploma:diplôme
diplomat:diplomate
director:directeur
dirt:saleté
dis:affichage
disadvantage:désavantage
disaster:catastrophe
disc:disque
discharge:décharge
discovery:découverte
discrepancy:écart
disease:maladie
dish:plat
dishwasher:lave-vaisselle
disparity:disparité
displaced:déplacés
ditch:fossé
diverse:diversité
divi:division
divorcee:femme divorcée
doctor:médecin
doe:biche
doer:homme d'action
dog:chien
dogs:chien
doily:napperon
doll:poupée
dolls:poupée
dominant:dominante
dominion:domination
donation:don
done:fait
donkey:âne
door:porte
dot:point
doubling:doublement
doubt:doute
dove:colombe
dow:fenêtre
downfall:chute
downgraded:dégradé
downside:inconvénient
dowry:dot
dozen:douzaine
draft:projet
drag:frein
drastic:réduction drastique
draw:tirage au sort
drawback:inconvénient
drawer:tiroir
drawing:dessin
dread:crainte
dreadful:terrible
dream:rêve
dreamer:rêveur
dress:robe
dresser:commode
drift:dérive
drill:perceuse
drink:boisson
drip:goutte à goutte
drive:lecteur
driving:conduite
drop:baisse
dropout:abandon
drought:sécheresse
drown:noyer
drowning:noyade
drum:tambour
drummer:batteur
drums:les tambours
dry:endroit sec
duchy:duché
duck:canard
duckling:caneton
dud:raté
due:raison
duet:duo
dug:puits creusé
dummy:mannequin
dumpster:benne à ordures
dung:bouse
dungeon:donjon
dust:poussière
dusty:endroit poussiéreux
duty:devoir
duvet:couette
dying:mourant
dystopia:dystopie
ea:d'évaluation environnementale
each:chacun
eagle:aigle
ear:oreille
earache:mal d'oreille
earful:plein les oreilles
earning:gain
earth:terre
earthquake:tremblement de terre
easy:facile
eccentric:excentrique
echo:écho
eco:éco
edge:bord
editor:éditeur
eel:anguille
effect:effet
egg:œuf
elbow:coude
elderly:personne âgée
electrical:champ électrique
electrician:électricien
element:élément
elephant:éléphant
elevated:élévation
elevator:ascenseur
email:e-mail
emblem:emblème
emergency:situation d'urgence
emission:émission
employ:emploi
employee:employé
employer:employeur
empt:anticiper
en:salle
enabling:environnement favorable
enclosed:espace clos
enclosure:enceinte
encyclopedia:encyclopédie
end:fin
endangered:danger
enduring:relation durable
enema:lavement
engine:moteur
engineer:ingénieur
enormous:énorme
enquiry:enquête
enrolment:effectif
enticing:alléchante
entity:entité
entrapment:piège
envelop:enveloppe
envelope:enveloppe
episode:épisode
equity:équité
eras:époques
eraser:effaceur
errand:course
error:erreur
eruption:éruption
escape:évasion
essay:essai
estate:succession
estimate:estimation
estuary:estuaire
etch:gravure
etching:gravure
eternity:éternité
evacuee:évacué
even:même
event:événement
ever:de plus
evidence:preuve
exam:examen
example:exemple
except:exception
excerpt:extrait
excitement:excitation
executrix:exécutrice
exercise:exercice
exhibit:exposition
exhibition:exposition
expectation:attente
expedition:expédition
expend:dépensent
expenditure:dépense
experience:expérience
experiment:expérience
exporting:pays exportateur
extensive:vaste
exterior:extérieur
extra:supplément de
extract:extrait
extraordinary:extraordinaire
eye:oeil
eyelid:paupière
eyesore:horreur
facility:installation
factory:usine
faded:disparu
faggot:fagot
fail:coup sûr
fair:foire
fairy:fée
faith:foi
faithful:fidèle
fake:faux
fall:baisse
fallen:baisse
familiar:familier
famous:célèbre
fand:fable
fantasy:fantasme
farm:ferme
farmer:agriculteur
farmhouse:ferme
fashion:mode
fashionable:mode
fast:jeûne
fat:matière grasse
fatal:accident mortel
father:père
fault:défaut
favor:faveur
favour:faveur
feat:exploit
feathered:plume
fee:taxe
feel:sensation
feeling:sentiment
feet:pieds
feline:félin
fellow:camarade
felt:feutre
female:femme
ferret:furet
fetish:fétiche
fever:fièvre
few:quelques
fiend:démon
fifth:cinquième
fig:figue
fight:combat
fighter:combattant
figure:chiffre
filibuster:obstruction
filling:remplissage
filter:filtre
fin:ailette
finance:financement
finding:conclusion
finds:trouve
fine:amende
finger:doigt
fir:sapin
fireman:pompier
firs:sapin
first:premier
firth:estuaire
fisherman:pêcheur
fistfight:bagarre
fitness:salle de fitness
flag:drapeau de
flame:flamme
flat:plat
flatmate:colocataire
flatmates:colocataires
flayer:écorcheur
flee:fuite
fleet:flotte
flight:vol
flood:inondation
florid:fleuri
florist:fleuriste
flourish:fanfare
flower:fleur
flowering:floraison
flue:conduit de fumée
flute:flûte
fly:mouche
flyover:survol
focus:accent
foes:ennemi
fog:brouillard
foil:feuille
fold:pli
folder:dossier
follow:suivi
food:aliment
foot:pied
footage:séquence
football:ballon de football
footstep:pas
fop:bellâtre
for:pour
fore:avant
forearm:avant-bras
foregoing:précédent
foreigner:étranger
foreman:contremaître
forgery:faux
forgotten:oubli
fork:fourchette
former:ancien
fortnight:quinzaine de jours
fossil:fossile
fount:source
fountain:fontaine
four:quatre
fox:renard
fragrance:parfum
frame:cadre
framed:encadré
framework:cadre
fraud:fraude
freak:monstre
free:libre
freedom:liberté
freemen:les citoyens d'honneur
freight:fret
freighter:cargo
french:français
fresher:fraîche
friend:ami
friends:des amis
fringe:frange
frog:grenouille
from:de
fucking:putain
fugitive:fugitif
full:plein
function:fonction
fundraising:collecte de fonds
fur:fourrure
furniture:meuble
further:autre
fury:fureur
fuse:fusible
fuss:histoire
gaberdine:gabardine
gait:démarche
gallery:galerie
gamble:pari
gambling:jeu
game:jeu
gamekeeper:garde-chasse
gamer:joueur
gander:coup d'oeil
gangbanger:gang
gap:écart
gapper:stoppeurs
gappers:stoppeurs
garb:costume
garbage:poubelle
gardener:jardinier
garland:guirlande
garlic:l'ail
garment:vêtement
gas:gaz
gash:entaille
gat:flingue
gate:grille
gateway:passerelle
gathering:rassemblement
gaunt:décharnée
gave:donné
gaze:regard
gem:joyau
gene:gène
genera:génération
generous:généreux
genuine:véritable
giant:géant
gift:cadeau
gig:concert
giggle:petit rire
giraffe:girafe
give:donner
giveaway:don
given:donnée
glance:coup d'œil
glaring:flagrant
glass:verre
glasses:des glaces
glaze:glaçure
glen:vallon
glimmer:lueur
glimpse:aperçu
glitch:pépin
glitter:scintillement
globetrotter:globe-trotter
gloomy:sombre
glove:gant
gloves:des gants
glow:lueur
glue:colle
gnat:moucheron
go:aller
goal:objectif
goalkeeper:gardien de but
goals:des objectifs
goat:chèvre
goblet:gobelet
goblin:gobelin
god:dieu
golden:occasion en or
goldfish:poisson rouge
goner:fichue
good:bon
goof:gaffe
goose:oie
gorilla:gorille
gossip:commère
grad:diplômé
graduate:diplômé
gram:gramme
grand:grande
granny:grand-mère
grant:subvention
grapefruit:pamplemousse
graph:graphe
grasp:compréhension
great:grand
greed:avidité
green:vert
greengrocer:marchand de légumes
greenhouse:serre
grey:gris
grid:grille
grievance:grief
grip:poignée
gripe:rogne
groom:palefrenier
groundsheet:tapis de sol
group:groupe
grow:croissance
growing:croissant
growl:grondement
grown:adulte
growth:croissance
guardian:tuteur
guess:supposition
guest:invité
guesthouse:maison d'hôtes
guidebook:guide
guided:visite
guides:guide
guitar:guitare
gum:gomme
gun:pistolet
guy:mec
gymnasium:gymnase
gypsy:gitan
habit:habitude
hail:grêle
hailing:saluant
hair:cheveu
hairdo:coiffure
hairdresser:salon de coiffure
hall:salle
hallway:couloir
halo:halogéno
halt:halte
hammer:marteau
hammock:hamac
hand:main
handbag:sac à main
handkerchief:mouchoir
handsome:beau
handyman:bricoleur
hang:coup
hangover:gueule de bois
hankering:penchant
happening:événement
happy:heureux
harbour:port
hardship:épreuve
harsh:âpre
hassle:dispute
hat:chapeau
hatch:trappe
have:avoir
haven:havre de paix
hawk:faucon
hazard:danger
hazmat:des matières dangereuses
he:il a
head:tête
headache:mal de tête
headband:serre-tête
headhunter:chasseur de têtes
headpiece:casque
headscarf:foulard
healthy:saine
heap:segment de mémoire
hear:entendre
heartbreak:chagrin
heat:chaleur
heater:dispositif de chauffage
heating:chauffage
hectic:trépidante
heel:talon
hefty:lourde
hell:enfer
helmet:casque
helper:assistant
hen:poule
hence:partant
her:son
herald:héraut
herb:herbe
herd:troupeau
heroic:héroïque
heron:héron
hi:salut
higher:supérieur
highlight:point culminant
highlighter:surligneur
hindrance:obstacle
hint:soupçon
hippo:hippopotame
his:son
historian:historien
history:histoire
hit:succès
hoax:canular
hoaxer:mystificateur
hob:plaque de cuisson
hobbies:passe-temps
hobby:passe-temps
hobo:clochard
hoe:houe
hog:porc
hold:cale
holdall:fourre-tout
hole:trou
holster:étui
homeless:sans-abri
homework:devoir
homosexual:homosexuel
honey:miel
hoodie:sweat à capuche
hoody:sweat à capuche
hoover:aspirateur
horse:cheval
hose:tuyau
hospital:hôpital
host:hôte
hote:hôte
hotel:hôtel
hour:heure
house:maison
housewife:femme au foyer
hovel:taudis
hover:vol stationnaire
however:cependant une
hub:plaque tournante
hubby:mari
huddle:pêle-mêle
hug:câlin
huge:énorme
hugging:étreindre
human:être humain
hunchback:bossu
hunched:bossu
hundredth:d'centième
hung:pendu
hunger:faim
hungry:faim
hurricane:ouragan
hurry:pressé
husband:mari
hut:cabane
hybrid:hybride
hyena:hyène
icon:icône
idea:idée
if:si
imaginary:imaginaire
imbalance:déséquilibre
important:importante
improvement:amélioration
in:dans
incentive:incitation
inch:pouce
income:revenu
incomplete:incomplète
inconvenience:inconvénient
increase:augmentation
increasing:nombre croissant de
indefatigable:infatigable
individual:individu
industrial:industriel
industrialize:industrialisation
industrialized:pays industrialisé
industries:industrie
industry:industrie
infinitive:infinitif
inform:informons
inhabitant:habitant
inhabitants:l'habitant
injury:blessure
inner:intérieure
inners:ampoules
inning:manche
inquiry:enquête
insect:insecte
insomniac:insomniaque
install:installation
instructor:instructeur
instructors:des instructeurs
insulation:isolation
insurer:assureur
intellectual:intellectuel
intensifier:intensificateur
interactive:outil interactif
interesting:intéressant
internship:stage
interpreter:interprète
interval:intervalle
interviewee:personne interrogée
intruder:intrus
inventor:inventeur
investigator:enquêteur
investor:investisseur
invite:invitation
invoice:facture
irony:ironie
is:est
issue:problème
it:il
itinerary:itinéraire
jack:vérin
jacket:enveloppe
jailhouse:prison
jamb:jambage
janitor:concierge
jarring:cognement
jaunt:escapade
jeans:jean
jellyfish:méduse
jerk:secousse
jersey:maillot
jigsaw:puzzle
job:emploi
join:jointure
joiner:menuisier
joke:blague
jolly:joyeux
journalist:journaliste
journey:voyage
judge:juge
jug:cruche
jump:saut
jumper:cavalier
junction:jonction
junk:jonque
just:juste
kayaking:kayak
keen:vif
keep:donjon
keeper:gardien
key:clé
keyboard:clavier
keys:quelques touches
kick:coup de pied
kid:enfant
kill:mort
killing:meurtre
kin:parent
kind:espèce
king:roi
kitchen:cuisine
kite:cerf-volant
kitten:chaton
knee:genou
knight:chevalier
knitted:tricot
lab:laboratoire
label:étiquette
laboratory:laboratoire
labyrinth:labyrinthe
lace:dentelle
lack:manque
lacklustre:terne
lad:garçon
lady:dame
ladybird:coccinelle
laid:ambiance décontractée
lake:lac
lamb:agneau
land:terre
landmark:point de repère
lane:voie
language:langue
lap:tour
laptop:ordinateur portable
last:dernière
lat:latitude
latch:loquet
late:retard
later:date ultérieure
lath:latte
lathe:tour
laugh:rire
laundry:buanderie
law:loi
lawsuit:procès
lawyer:avocat
lay:mise à
layer:couche
layout:disposition
layover:escale
leader:chef de file
leaf:feuille
leaflet:dépliant
leak:fuite
leaked:fuite
leap:bond
least:moins
leather:cuir
leave:congé
lecher:paillard
leek:poireau
left:gauche
leg:jambe
lemon:citron
lemonade:limonade
lend:prêt
lengthy:longue
leopard:léopard
lesser:moindre
let:laissez-
letter:lettre
liar:menteur
liberal:libéral
library:bibliothèque
lid:couvercle
lie:mensonge
life:vie
lifeguard:sauveteur
lift:ascenseur
light:lumière
lightbulb:ampoule
lighter:briquet
lightning:éclair
like:comme
lily:fleur de lys
limit:limite
limited:nombre limité de
limp:boiterie
linchpin:pivot
link:liaison
lip:lèvre
little:peu
living:vie
load:charge
loaf:pain
loan:prêt
lobby:hall d'accueil
lobster:homard
local:locale
location:emplacement
lock:serrure
locker:casier
locket:médaillon
lodge:pavillon
log:journal
lone:seul
loner:solitaire
long:longue
loop:boucle
loose:lâche
lorry:camion
loss:perte
lot:beaucoup
lots:bon nombre
loud:fort
lounge:salon
love:amour
lovely:belle
loving:aimant
low:faible
lowering:abaissement
lump:bosse
lunatic:fou
lung:poumon
lure:leurre
luxury:luxe
mach:interféromètre de Mach
mad:fou
madness:folie
magician:magicien
magnificent:magnifique
maid:femme de ménage
maiden:jefille
main:principal
major:important
makeover:cure de jouvence
male:homme
malign:malin
malignant:tumeur maligne
mall:centre commercial
man:homme
manage:gestion
manager:gestionnaire
mandate:mandat
mandatory:obligatoire
mane:crinière
manger:crèche
mango:mangue
manner:de manière
manufacture:fabrication
manufacturer:fabricant
many:nombre
map:carte
maqui:maquis
marble:marbre
marine:marin
marker:marqueur
market:marché
marriage:mariage
mastermind:cerveau
masterpiece:chef-d'œuvre
masters:maîtrise
mat:natte
mate:compagnon
mater:mère
math:cours de mathématiques
maths:mathématiques
matter:question
may:peut
me:moi
meadow:prairie
meagre:maigre
meal:repas
mean:moyenne
meaning:sens
means:moyen
meant:signifiait
measure:mesure
mechanic:mécanicien
media:support
mediator:médiateur
medium:support
meeting:réunion
melting:fusion
memoir:mémoire
memorable:moment inoubliable
memorial:mémorial
memory:mémoire
mere:simple
merge:fusion
merger:fusion
mermaid:sirène
mes:message
mess:gâchis
messy:désordre
metro:station de métro
mic:micro
microwave:micro-ondes
mid:milieu
middle:milieu
milestone:étape
military:militaire
milk:lait
milkshake:milk-shake
mill:broyeur
mind:esprit
minded:esprit
minor:mineur
minority:minorité
mint:menthe
mirror:miroir
mis:mission
misdemeanor:délit
mishap:accident
missteps:faux pas
mist:brouillard
mistake:erreur
mixture:mélange
moa:protocole d'accord
moan:gémissement
moat:fossé
mob:foule
mock:maquette
mockery:moquerie
model:modèle
mole:taupe
mom:maman
moment:instant
monitor:moniteur
monkey:singe
month:mois
mood:état d'esprit
moose:orignal
morally:moralement
more:plus
morn:matin
morning:matinée
mortarboard:mortier
mortgage:hypothèque
mosquito:moustique
mother:mère
motto:devise
mou:protocole d'accord
mould:moule
mount:monture
mountain:montagne
mouse:souris
mouth:bouche
movie:film
moviegoer:cinéphile
much:beaucoup
mud:boue
muff:manchon
multinational:multinationale
mum:maman
murderer:meurtrier
museum:musée
mushroom:champignon
music:musique
musical:comédie musicale
mustard:moutarde
myth:mythe
mythology:mythologie
nag:bourrin
nail:clou
nanny:nounou
nap:sieste
nappy:couche
narrative:récit
narrowing:rétrécissement
native:natif
natural:naturel
navigation:système de navigation
near:quasi
nearby:proximité
neck:cou
necklace:collier
need:nécessité
needle:aiguille
needs:évaluation des besoins
negro:nègre
neigh:hennissement
neighbor:voisin
neighborhood:quartier
neighbour:voisin
neighbourhood:quartier
nephew:neveu
nerve:nerf
nest:nid
net:filet
netting:filet
network:réseau
new:nouvelle
newcomer:nouveau venu
newer:version plus récente
newsagents:marchand de journaux
nice:belle
nickname:surnom
niece:nièce
night:nuit
nightcap:bonnet de nuit
nightclub:discothèque
nightingale:rossignol
nightmare:cauchemar
nineteen:dix-neuf
nipple:mamelon
no:pas
nod:clin d'œil
noise:bruit
noisy:environnement bruyant
noon:midi
noose:noeud coulant
nor:ni
norm:norme
normal:normale
nose:nez
not:pas
notebook:ordinateur portable
notepad:bloc-notes
notice:avis
noun:nom
novelist:romancier
nude:nu
number:numéro
nurs:infir
nurse:infirmière
nurser:biberon
nursery:pépinière
nursing:infirmier
nut:écrou
obese:obèse
objective:objectif
observer:observateur
octopus:pieuvre
of:de
off:large
office:bureau
oil:huile
old:ancienne
older:ancien
omen:présage
ominous:sinistre
on:sur
onion:oignon
onions:l'oignon
only:seule
operation:opération
or:ou
orchard:verger
orchestra:orchestre
order:ordre
ordered:commandés
organ:organe
organise:organisent
organization:organisation
orgasm:orgasme
orphan:orphelin
orphanage:orphelinat
