abuse:abus
accordion:accordéon
acquaint:connaissance
activity:activité
actress:actrice
ad:annonce
adaptor:adaptateur
address:adresse
adult:adulte
advance:avance
advancement:avancement
adventurer:aventurier
advert:annonce
advertisement:annonce
again:nouveau
agency:agence
aircraft:aéronef
airport:aéroport
allotment:lotissement
almond:amande
along:long
angel:ange
anniversary:anniversaire
answer:réponse
apartment:appartement
app:application
apple:pomme
appoint:nomination
appointment:rendez-vous
apricot:abricot
architect:architecte
arm:bras
array:tableau
arrival:arrivée
arrow:flèche
as:comme
asp:aspic
asshole:trou du cul
assignment:mission
astronaut:astronaute
athlete:athlète
attack:attaque
attic:grenier
author:auteur
away:écart
awful:terrible
baby:bébé
backlash:jeu
backpack:sac à dos
bad:mauvaise
badass:dur à cuire
bag:sac
bail:caution
bailout:plde sauvetage
baker:boulanger
balcony:balcon
ball:boule
balloon:ballon
ballot:bulletin de vote
ban:interdiction
banana:banane
band:bande
bangs:frange
bank:banque
banter:badinage
bar:barre
bargain:bonne affaire
barn:grange
barrack:caserne
barren:stérile
barrister:avocat
bask:prélasser
basket:panier
bass:basse
bat:chauve-souris
bath:bain
bathe:bain
bathroom:salle de bains
batt:nappe
battering:coups
battle:bataille
be:être
beach:plage
bead:bourrelet
bear:ours
bearing:palier
beast:bête
beat:battement
beautiful:belle
beauty:beauté
beckoning:fait signe
bed:lit
bedrock:socle
bedroom:chambre
bee:abeille
beef:boeuf
beer:bière
beet:betterave
beggar:mendiant
begin:début
being:étant
belie:démentent
belief:croyance
believe:croient
bell:cloche
bench:banc
best:meilleure
bet:pari
better:meilleur
bias:biais
bidding:appel d'offres
biennial:biennale
biggest:plus grand
bigwig:gros bonnet
bike:vélo
bill:projet de loi
billion:milliard
bin:bac
bird:oiseau
birthday:anniversaire
bit:peu
bitch:chienne
bite:morsure
bitter:goût amer
black:noir
blade:lame
blast:explosion
blaze:incendie
bless:bénir
blessing:bénédiction
blow:coup
blowjob:pipe
board:conseil
boarder:pensionnaire
boat:bateau
boatload:cargaison
bobbin:bobine
bodies:corps
bold:audacieux
bond:lien
bondage:servitude
bone:os
boner:gaffe
bonfire:feu de joie
book:livre
bookkeeper:comptable
booklet:livret
booze:alcool
border:frontière
bore:alésage
boulder:rocher
bounce:rebond
bout:combat
bow:archet
bowl:bol
box:boîtier
boy:garçon
bra:soutien-gorge
brace:accolade
brain:cerveau
brainstorming:remue-méninges
bread:pain
breaded:panés
break:pause
breath:souffle
breathless:souffle
breed:race
breeding:élevage
bride:mariée
bridge:pont
brig:brick
bright:brillant
broccoli:brocoli
broom:balai
brother:frère
brought:traduits
browser:navigateur
brush:brosse
buccaneer:boucanier
buck:mâle
buckler:bouclier
bugbear:épouvantail
bugger:bougre
build:accumulation
building:bâtiment
built:bâti
bullet:balle
bully:tyran
bum:clochard
bun:petit pain
bunch:groupe
bund:digue
bundle:faisceau
burn:brûlure
business:entreprise
businessman:homme d'affaires
businesswoman:femme d'affaires
but:mais
butter:beurre
butterfly:papillon
button:bouton
bye:laissez-passer
byword:synonyme
cabin:cabine
cabinet:coffret
cable:câble
cache:antémémoire
cafe:café
cake:gâteau
calculator:calculatrice
call:appel
called:dite
cam:came
camel:chameau
can:canette
candy:bonbon
canvas:toile
cap:couvercle
caption:légende
card:carte
care:charge
careful:attention
carer:soignant
carol:chant
carpet:tapis
carrot:carotte
cartoon:dessin animé
case:boîtier
cashier:caissière
cast:casting
casting:pièce de fonderie
castle:château
casual:ambiance décontractée
cat:chat
category:catégorie
cauliflower:chou-fleur
cellar:cave
cello:violoncelle
cemetery:cimetière
centralizing:centralisation
century:siècle
chair:chaise
chal:défi
challenge:défi
champ:champion
change:changement
changer:changeur
chap:chapitre
char:chevalier
charity:organisme de bienfaisance
charm:charme
charred:carbonisé
chase:course-poursuite
chat:causerie
cheat:tricheur
cheater:tricheur
check:chèque
cheek:joue
cheetah:guépard
cherry:cerise
chest:coffre
chic:cadre chic
chicken:poulet
child:enfant
children:enfants
chill:frisson
chin:menton
chink:fente
chip:puce
chips:puces
chocolate:chocolat
choice:choix
choir:chorale
choker:tour de cou
chord:accord
chump:idiot
cigar:cigare
cigaret:cigarette
cinch:jeu d'enfant
cinema:cinéma
cite:citer
citizens:citoyenne
civilization:civilisation
claim:réclamation
clamp:pince
clash:affrontement
class:classe
classic:classique
claw:griffe
cleaning:nettoyage
clear:claire
clearing:clairière
cleavage:clivage
clingy:collant
clipper:tondeuse
clock:horloge
close:proche
closer:proche
closet:placard
closeup:gros plan
clothe:vêtement
cloud:nuage
clout:influence
clue:indice
coach:entraîneur
coaster:montagne
coat:couche
cockroach:cafard
coconut:noix de coco
coffee:café
coil:bobine
coin:pièce de monnaie
coiner:faux-monnayeur
cold:froid
collector:collectionneur
comb:peigne
comedy:comédie
coming:venue
common:commune
comp:échantillon
company:société
complaint:plainte
compute:calcul
computer:ordinateur
confide:confidence
confident:confiance
conflict:conflit
connect:connexion
connection:liaison
constraint:contrainte
contest:concours
contractor:entrepreneur
conviction:condamnation
cooker:cuiseur
cop:flic
cope:face
copper:cuivre
corpse:cadavre
correspondent:correspondant
corrigendum:rectificatif
cost:coût
cot:lit de bébé
cotton:coton
couch:canapé
count:comptage
countdown:compte à rebours
country:pays
coup:coup d'Etat
course:cours
court:tribunal
cover:couvercle
covered:couvert
covering:revêtement
cow:vache
crack:fissure
crap:merde
crate:caisse
cream:crème
creature:créature
credit:crédit
creed:credo
creek:ruisseau
creep:fluage
creeper:plante grimpante
crepe:crêpe
crib:crèche
criminal:criminel
cringe:grincer des dents
crisp:croustillant
crook:escroc
crop:récolte
cross:croix
crossfire:échange de tirs
crown:couronne
cruiser:croiseur
crumple:déformation
crumpled:froissé
crush:écrasement
cry:cri
cuckoo:coucou
cunt:chatte
cup:tasse
cur:actu
curator:conservateur
cure:remède
curio:bibelot
curious:curieux
curiously:curiosité
curl:boucle
curse:malédiction
curtailing:restreignant
curtain:rideau
curve:courbe
customer:client
cut:coupe
cute:mignon
cutlery:coutellerie
dagger:poignard
daily:quotidien
dare:défi
dash:tiret
daughters:fille
day:jour
daydream:rêve éveillé
days:jour
daze:état d'hébétude
dead:mort
deal:accord
dear:être cher
dearth:pénurie
debt:dette
deco:déco
decree:décret
deed:acte
deep:profonde
defender:défenseur
degree:degré
delay:retard
delicatessen:épicerie fine
delivery:prestation
den:repaire
dens:tanière
depart:départ
deposit:dépôt
designer:concepteur
desire:désir
desk:bureau
detective:détective
devil:diable
dialect:dialecte
diaper:couche-culotte
diary:journal
dibber:plantoir
dice:dé
dick:bite
dickhead:connard
did:fait
dig:fouille
dignity:dignité
dilemma:dilemme
dim:faible
dime:centime
dimmer:gradateur
dimple:fossette
dinner:dîner
dip:plongeon
directory:répertoire
dirty:sale
dis:affichage
disas:démontage
disaster:catastrophe
dish:plat
dishwasher:lave-vaisselle
disk:disque
displacement:déplacement
display:dispositif d'affichage
distressed:détresse
disused:désaffectée
do:faire
doctor:médecin
doddle:jeu d'enfant
doe:biche
does:ne
dog:chien
doll:poupée
dolphin:dauphin
done:fait
donkey:âne
dough:pâte
down:baisse
downer:déprimant
dozen:douzaine
drag:frein
drawer:tiroir
drawing:dessin
dread:crainte
dream:rêve
dress:robe
dressing:pansement
drink:boisson
drive:lecteur
drumroll:roulement de tambour
duck:canard
duct:conduit
dull:sourd
dummy:mannequin
dump:dépotoir
dwarf:nain
ea:d'évaluation environnementale
ear:oreille
earl:comte
early:début
earthquake:tremblement de terre
easel:chevalet
easily:endroit facilement
easy:facile
edge:bord
eerie:sinistre
effect:effet
egg:œuf
elegant:élégant
elephant:éléphant
elite:élite
elk:élan
email:e-mail
embrace:étreinte
emergency:situation d'urgence
employer:employeur
encore:rappel
encounter:rencontre
engineer:ingénieur
enigma:énigme
enjoy:jouissent d'
enjoyable:agréable
enjoyed:apprécié
enquiry:enquête
enticing:alléchante
environment:environnement
environmental:environnement
environmentally:environnement
era:ère
eras:époques
eraser:effaceur
essay:essai
event:événement
everyone:monde
evolution:évolution
exit:sortie
exotic:exotique
expensive:coûteux
extraordinary:extraordinaire
extremely:extrêmement
eye:oeil
eyedropper:pipette
fact:fait
factory:usine
fade:fondu
fag:pédé
faggot:fagot
fair:foire
fairly:assez
fairy:fée
faith:foi
faithful:fidèle
falcon:faucon
fall:baisse
fame:renommée
family:famille
fancy:fantaisie
far:bien
fare:tarif
farewell:adieu
farm:ferme
farming:agriculture
farrier:maréchal-ferrant
fart:pet
fat:matière grasse
fatal:accident mortel
fate:destin
favour:faveur
fawn:faon
fear:peur
feat:exploit
fee:taxe
feed:charge
feel:sensation
feeling:sentiment
fees:frais
fellow:camarade
fence:clôture
ferret:furet
festive:fête
fever:fièvre
few:quelques
fifth:cinquième
fig:figue
fight:combat
fighting:combat
file:dossier
fin:ailette
final:finale
financial:financier
fine:amende
finger:doigt
fir:sapin
fire:incendie
firs:sapin
first:premier
fish:poisson
fisherman:pêcheur
fisherwoman:pêcheuse
fist:coup de poing
fit:ajustement
fiver:billet de cinq livres
fixture:luminaire
flag:drapeau de
flask:fiole
flat:plat
fleet:flotte
flick:film
flicker:scintillement
flight:vol
fling:aventure
flirty:dragueur
floor:étage
flunky:larbin
flush:chasse d'eau
flute:flûte
fly:mouche
folder:dossier
follow:suivi
fool:fou
foot:pied
footage:séquence
footballer:footballeur
for:pour
ford:gué
fore:avant
forefront:avant-garde
foreign:étranger
foreigner:étranger
forgery:faux
fork:fourchette
form:forme
formal:mise en
forme:porte-plaque
former:ancien
fortnight:quinzaine de jours
fox:renard
frame:cadre
framework:cadre
freak:monstre
freaking:putain
free:libre
freedom:liberté
freezer:congélateur
fresh:nouvelle
freshman:étudiant de première année
fridge:réfrigérateur
friend:ami
friendly:match amical
friendship:amitié
frog:grenouille
frond:fronde
froze:gelé
frozen:congelés
fuck:baise
fucking:putain
fug:touffeur
full:plein
fuming:fumant
fun:amusement
function:fonction
functional:fonctionnelle
funeral:enterrement
funny:drôle
furnace:four
furniture:meuble
fuse:fusible
fuss:histoire
game:jeu
gamekeeper:garde-chasse
garden:jardin
gate:grille
gene:gène
generation:génération
generous:généreux
genius:génie
genuine:véritable
genuinely:véritable
gerund:gérondif
gesture:geste
ghost:fantôme
giant:géant
gib:lardon
gift:cadeau
gig:concert
gipsy:gitan
girl:fille
girlfriend:petite amie
giveaway:don
glance:coup d'œil
glass:verre
gleam:lueur
glimpse:aperçu
glint:lueur
glitch:pépin
global:approche globale
glove:gant
go:aller
god:dieu
going:aller
goiter:goitre
goldfish:poisson rouge
good:bon
goodwill:écart d'acquisition
goose:oie
grand:grande
grant:subvention
grape:grain de raisin
grapefruit:pamplemousse
graphic:graphique
grasp:compréhension
greasy:grasse
great:grand
gree:degré
greenish:verdâtre
greeting:salutation
grid:grille
grin:sourire
grit:abrasif
grot:grotte
group:groupe
growing:croissant
growth:croissance
grudge:rancune
guard:gardien
gully:ravin
gum:gomme
gun:pistolet
gust:rafale
guy:mec
gym:salle de gym
haberdashery:mercerie
hair:cheveu
haircut:coupe de cheveux
hairstyle:coiffure
halt:halte
hamburg:hambourg
hammer:marteau
hand:main
handbag:sac à main
hands:main
happy:heureux
harbour:port
hard:disque
harsh:âpre
hat:chapeau
haunt:repaire
haunting:hantise
haven:havre de paix
hawk:faucon
he:il a
head:tête
headache:mal de tête
heard:entendu
heart:cœur
heartbeat:battement de coeur
heartbreak:chagrin
heat:chaleur
heist:hold-up
hemp:chanvre
her:son
herring:hareng
hi:salut
high:haut
highlight:point culminant
highlighter:surligneur
hike:randonnée
hill:colline
hint:soupçon
hip:hanche
hit:succès
hoax:canular
hob:plaque de cuisson
hobby:passe-temps
hold:cale
hole:trou
holiday:jour férié
holograph:testament olographe
holy:saint
home:maison
homecoming:retour aux sources
hon:député
horse:cheval
horseshoe:fer à cheval
horsewhip:cravache
host:hôte
hotel:hôtel
hour:heure
house:maison
huddle:pêle-mêle
hue:teinte
hug:câlin
human:être humain
hunger:faim
hunk:morceau
hurricane:ouragan
husband:mari
hustle:agitation
hydrangea:hortensia
hype:battage
ice:glace
idea:idée
identical:identique
iguana:iguane
impairment:perte de valeur
improv:improvisation
improvise:improviser
improvised:improvisée
in:dans
increase:augmentation
indoor:piscine couverte
industry:industrie
infinitive:infinitif
intensifier:intensificateur
internship:stage
introvert:introverti
intruder:intrus
iron:fer à repasser
issue:problème
jacket:enveloppe
jalopy:tacot
jar:bocal
jawline:mâchoire
jerk:secousse
jersey:maillot
jet:jet d'
jewelry:bijou
jib:foc
jiffy:tournemain
job:emploi
joiner:menuisier
joke:blague
jolt:secousse
journalist:journaliste
journey:voyage
judge:juge
juice:jus
jumper:cavalier
keen:vif
keep:donjon
keeper:gardien
kettle:bouilloire
key:clé
keyboard:clavier
kick:coup de pied
kid:enfant
kiddo:gamin
kill:mort
killer:tueur
killjoy:rabat-joie
kind:espèce
king:roi
kingpin:pivot
kink:coude
kiss:baiser
kitchen:cuisine
kitten:chaton
knot:noeud
lace:dentelle
lack:manque
lad:garçon
ladder:échelle
lade:le bief
lake:lac
lambasting:fustigeant
lamp:lampe
landscape:paysage
language:langue
lapse:laps
large:grand
lark:alouette
lassie:gamine
last:dernière
later:date ultérieure
laugh:rire
laughing:rire
law:loi
lawsuit:procès
lawyer:avocat
lay:mise à
layer:couche
leading:chef de file
leaf:feuille
leak:fuite
lean:maigre
least:moins
leave:congé
lecher:paillard
lecture:conférence
leek:poireau
lemon:citron
lense:lentille
less:moins
let:laissez-
letter:lettre
lettuce:laitue
level:niveau
lie:mensonge
life:vie
lifelong:vie
lifetime:vie
lift:ascenseur
light:lumière
lightbulb:ampoule
like:comme
liking:goût
limit:limite
limp:boiterie
liner:doublure
link:liaison
lip:lèvre
litany:litanie
little:peu
living:vie
loaf:pain
loan:prêt
lock:serrure
log:journal
logical:logique
loincloth:pagne
long:longue
longs:aspire
look:coup d'œil
loss:perte
lot:beaucoup
lounge:salon
love:amour
loved:être cher
lover:amant
low:faible
lug:patte
luger:lugeur
lump:bosse
lush:luxuriant
maggot:asticot
magician:magicien
maid:femme de ménage
major:important
man:homme
mania:manie
maniac:maniaque
mansion:manoir
map:carte
marshmallow:guimauve
master:maître
mat:natte
mate:compagnon
mater:mère
matt:mat
matter:question
mattress:matelas
mayor:maire
me:moi
mean:moyenne
means:moyen
measure:mesure
medic:médecin
medicament:médicament
medication:médicament
medicine:médicament
meditation:méditation
meet:rencontre
meeting:réunion
member:membre
mentality:mentalité
merit:mérite
mermaid:sirène
mes:message
mesh:maillage
mess:gâchis
messy:désordre
met:rencontrés
microwave:micro-ondes
mid:milieu
midnight:minuit
mild:légère
mince:hachis
minnow:vairon
minor:mineur
minority:minorité
minutes:procès-verbal
mirror:miroir
mistake:erreur
mite:acarien
mix:mélange
mixture:mélange
model:modèle
modelling:modélisation
mole:taupe
mom:maman
moment:instant
momenta:moments
momentary:passagère
mongoose:mangouste
moose:orignal
moped:cyclomoteur
more:plus
morning:matinée
mosquito:moustique
most:plus
moth:papillon de nuit
moti:motivation
motion:mouvement
motorhome:camping-car
motto:devise
mou:protocole d'accord
mound:monticule
mount:monture
mountain:montagne
mounting:montage
mouse:souris
mouth:bouche
mouthful:bouchée
move:mouvement
movement:mouvement
movies:cinéma
moving:déplacement
much:beaucoup
mud:boue
muddle:confusion
mug:tasse
munch:grignoter
murderer:meurtrier
museum:musée
mush:bouillie
musical:comédie musicale
musician:musicien
mutt:chien
mutual:mutuelle
mux:multiplexeur
my:mon
myth:mythe
nail:clou
naked:nu
name:nom
nanny:nounou
nap:sieste
narcotic:stupéfiant
narrow:étroite
nasal:nasale
navigation:système de navigation
neck:cou
necklace:collier
need:nécessité
needle:aiguille
negative:négatif
neighbour:voisin
nest:nid
net:filet
new:nouvelle
newspaper:journal
nice:belle
nigh:proche
night:nuit
nightclub:discothèque
nightingale:rossignol
nit:lente
no:pas
nobody:personne
noise:bruit
noose:noeud coulant
norm:norme
normal:normale
nose:nez
not:pas
notebook:ordinateur portable
novelist:romancier
nudge:coup de pouce
number:numéro
nurs:infir
nurse:infirmière
oath:serment
occupied:occupé
office:bureau
official:fonctionnaire
oil:huile
old:ancienne
older:ancien
onion:oignon
operation:opération
opportunity:opportunité
options:des options
order:ordre
orgasm:orgasme
other:autre
otter:loutre
ou:unité d'organisation
outlet:orifice de sortie
oven:four
overcoat:pardessus
overdraft:découvert
overseas:étranger
overview:aperçu
owl:hibou
oyster:huître
packet:paquet
painting:peinture
pal:copain
palace:palais
pan:poêle
pancake:crêpe
pane:volet
pant:pantalon
paperboy:livreur
par:pied d'égalité
parcel:parcelle
parentage:filiation
parsnip:panais
part:partie
particular:particulier
particularly:particulier
parting:séparation
party:parti
pass:passage
pat:tape
patchy:inégale
path:chemin
pattern:motif
peach:pêche
peak:pic
peanut:cacahuète
pear:poire
pebble:caillou
peck:bise
pee:pipi
peek:coup d'oeil
peep:coup d'œil
peg:cheville
pen:stylo
pencil:crayon
penis:pénis
penny:sou
pens:enclos
people:peuple
pepper:poivron
per:par
perfect:parfaite
performer:artiste
perishing:déterioration
perk:avantage
persimmon:kaki
person:personne
personal:personnel
pet:animal de compagnie
phone:téléphone
picky:pointilleux
picnic:pique-nique
pie:tarte
piece:morceau
pier:quai
pig:cochon
pillow:oreiller
pilot:pilote
pimp:proxénète
pin:axe
pine:pin
pineapple:ananas
pineapples:ananas
pioneer:pionnier
piping:tuyauterie
piss:pisse
pit:fosse
pity:dommage
place:lieu
plague:fléau
plain:plaine
plank:planche
plant:plante
plaster:plâtre
plat:plate
plate:plaque
platoon:peloton
play:pièce de théâtre
plea:plaidoyer
pleas:plaidoyer
pleasure:plaisir
pledge:gage
plot:parcelle
ploy:stratagème
plug:bouchon
plum:prune
pocket:poche
poem:poème
poke:sac
pole:poteau
police:policier
policewoman:policière
political:politique
politician:politicien
poll:sondage
pomegranate:grenade
pond:étang
pony:poney
poodle:caniche
pooh:ourson
poor:mauvaise
poorly:mal
pork:porc
porridge:bouillie
porter:portier
poser:poseur
posers:frimeurs
postcard:carte postale
postcode:code postal
posting:annonce
postman:facteur
potent:puissant
pounding:martèlement
pour:écoulement
pout:moue
pre:pré
precise:précision
premium:prime
prenup:contrat de mariage
preposition:préposition
presentation:présentation
pretty:jolie
preview:aperçu
price:prix
pride:fierté
priest:prêtre
print:impression
printer:imprimante
prior:préalable
prise:prix
private:privé
privilege:privilège
prob:pro
problem:problème
process:processus
product:produit
professional:professionnel
professionally:professionnel
project:projet
promiscuous:promiscuité
promise:promesse
promising:prometteuse
prompt:invite
prop:hélice
property:propriété
proposal:proposition
prosecution:poursuite
prostitute:prostituée
providing:fourniture
psychic:voyante
public:bien public
pullover:pull-over
pulpit:chaire
pun:jeu de mots
punch:poinçon
puncture:crevaison
punnet:barquette
pup:chiot
puppy:chiot
purple:violet
purpose:objectif
purr:ronronnement
purse:sac à main
pushover:jeu d'enfant
quarter:quart
queen:reine
quell:réprimer
quick:rapide
quickly:rapidement
quiet:environnement calme
quince:coing
quip:boutade
quite:assez
quiver:carquois
rabbit:lapin
race:course
racket:raquette
raffle:tombola
rag:chiffon
rain:pluie
rainwater:eau de pluie
raise:augmentation de salaire
raised:soulevé
rake:râteau
rally:rassemblement
ran:couru
range:gamme
ranger:garde
rant:diatribe
rape:viol
rascal:coquin
rash:éruption
rate:taux
rather:lieu
rattle:hochet
raw:première
re:ré
reach:portée
reading:lecture
real:véritable
reason:motif
reasonable:délai raisonnable
receipt:réception
reception:réception
receptionist:réceptionniste
ref:arbitre
refund:remboursement
region:région
register:registre
rehearsal:répétition
relaxing:moment de détente
relief:soulagement
relieve:soulager
remade:refaite
remember:souvenir
remorse:remords
remote:télécommande
rep:représentant
repair:réparation
report:rapport
request:demande
requirement:exigence
resend:réexpédition
residence:résidence
respite:répit
response:réponse
rest:reste
restraining:ordonnance d'interdiction
retarded:retard
retrial:nouveau procès
review:avis
revolution:révolution
reward:récompense
rewarding:expérience enrichissante
rid:débarrasser
riddance:débarras
riddle:énigme
ride:tour
riffle:fusil
rift:fossé
rig:plate-forme
ring:noyau
rink:patinoire
rise:élévation
ritual:rituel
river:rivière
rock:rocher
rod:tige
role:rôle
room:chambre
rooster:coq
root:racine
rope:corde
rough:rude
roughly:gros
round:tour
rousing:vibrant
row:rangée
rub:frottement
rubber:caoutchouc
rubbished:démenti
rug:tapis
ruin:ruine
ruler:règle
ruling:décision
rum:rhum
run:course
rung:échelon
runny:écoulement nasal
rush:ruée
sad:triste
safe:coffre-fort
salt:de ses sels
sample:échantillon
sand:sable
sap:sève
saucepan:casserole
savage:sauvage
savior:sauveur
saw:scie
say:leur mot à dire
scale:échelle
scales:balance
scallop:pétoncle
scan:balayage
scar:cicatrice
scare:petite frayeur
scarf:écharpe
scary:effrayant
scent:parfum
scented:parfum
schedule:calendrier
scheme:système
school:école
scientist:scientifique
scratch:égratignure
screech:cri
screenplay:scénario
screwdriver:tournevis
scrub:gommage
scuffled:bagarrés
sea:mer
seat:siège
second:seconde
security:sécurité
seizure:saisie
self:auto
seminary:séminaire
senior:personne âgée
sense:sentiment
sensibility:sensibilité
sent:envoyé
sentence:phrase
serving:portion
set:ensemble
setback:revers
setup:installation
shade:ombre
shadow:ombre
shall:doit
shallow:peu profonde
sham:imposture
shame:honte
shank:tige
shape:forme
share:part
sharpener:affûteur
she:elle a
sheep:mouton
sheet:feuille
shelf:étagère
shell:enveloppe
shelve:étagère
shield:bouclier
shift:décalage
shimmer:miroitement
ship:navire
shirt:chemise
shit:merde
shive:bûchettes
shock:choc
shoe:chaussure
shoot:tournage
shop:boutique
shopkeeper:commerçant
shopping:centre commercial
short:court
shortage:pénurie
shot:coup de feu
shotgun:fusil de chasse
should:must
show:spectacle
shower:douche
side:côté
sidebar:barre latérale
sidekick:acolyte
sieve:tamis
sigh:soupir
sighted:voyante
sign:signe
signposted:balisé
silver:médaille d'argent
sim:carte SIM
simple:d'simple
sin:péché
singer:chanteur
single:seule
sink:évier
sinkhole:gouffre
sinner:pécheur
sister:soeur
skirt:jupe
slaughter:massacre
slave:esclave
sleek:élégant
sleep:sommeil
sleepless:insomniaque
sleepy:somnolence
slice:tranche
slide:coulisseau
slight:légère
slightly:peu
slip:bordereau
sliver:ruban
slob:plouc
sloth:paresseux
slug:limace
slump:marasme
slut:salope
small:petit
smallpox:variole
smart:puce
smear:frottis
smile:sourire
smiling:sourire
smirk:sourire
smooth:surface lisse
snack:collation
snake:serpent
snap:clin d'oeil
sneaker:espadrille
sneer:ricanement
snitch:mouchard
so:sorte
social:sociale
sock:chaussette
soft:doux
song:chanson
sore:plaie
soul:âme
sound:son
soup:soupe
sources:des sources
spade:chat
span:travée
spank:fessée
spare:pièce de rechange
spark:étincelle
spate:avalanche
speciality:spécialité
speech:discours
spell:sort
spice:épice
spider:araignée
spilt:déversement
splice:épissure
splinter:écharde
split:scission
spoil:butin
sponge:éponge
spoon:cuillère
spoonful:cuillerée
sportsman:sportif
sportsperson:sportif
spouse:conjoint
spreadsheet:feuille de calcul
spur:éperon
spy:espion
squall:bourrasque
square:carré
squeal:cri
squid:calmar
squirrel:écureuil
stab:coup de couteau
stadium:stade
staff:personnel
stage:étape
stalk:tige
stalker:harceleur
stall:stalle
stamp:tampon
stand:support
stands:peuplements
standstill:l'arrêt
stapler:agrafeuse
star:astérisque
starter:démarreur
statement:déclaration
steam:vapeur
steaming:cuisson à lvapeur
steel:acier
steep:forte
steer:boeuf
stench:odeur
stir:émoi
stirring:agitation
stomach:estomac
stone:pierre
stood:s'élève
stopping:arrêt
storage:stockage
storied:légendaire
storm:tempête
story:histoire
straight:droite
straightjacket:camisole de force
strain:souche
strainer:crépine
strange:étrange
stranger:étranger
strap:sangle
stream:courant
street:rue
string:chaîne
stroke:accident vasculaire cérébral
strong:forte
stronger:plus forte
stud:plot
student:étudiant
study:étude
stuffy:congestion
stunt:coup
sty:porcherie
stylist:styliste
sub:sous
subpoena:citation à comparaître
subsidiary:filiale
substitute:substitut
succes:succès
success:réussite
successful:succès
such:telle
sucker:ventouse
suit:costume
sum:somme
summation:sommation
summer:été
summon:convoquer
summons:citation à comparaître
sunburn:coup de soleil
sunglass:paire de lunettes
suntan:bronzage
supermarket:supermarché
supplier:fournisseur
surge:hausse
surgeon:chirurgien
surround:encadrement
survey:enquête
survivor:survivant
suspicious:suspect
swallow:hirondelle
sweater:chandail
sweatshirt:sweat-shirt
sweeping:balayage
sweetcorn:maïs doux
swimmer:nageur
swish:bruissement
symmetric:symétrique
symphony:symphonie
syringe:seringue
tab:onglet
tad:peu
tag:balise
take:prise
takeaway:plat à emporter
tale:conte
tall:hauteur
tambourine:tambourin
tang:tenon
tangle:enchevêtrement
tank:réservoir
tantrum:accès de colère
tap:robinet
tapered:conique
target:cible
tart:tarte
task:tâche
taste:avant-goût
tax:taxe
tea:thé
teacher:enseignant
team:équipe
teardrop:larme
teas:thés
tease:allumeuse
tech:technologie
technic:technique
technical:technique
tee:tee-shirt
telephone:téléphone
teleprompter:prompteur
tell:dire
temp:température
temperature:température
tender:appel d'offres
tense:climat tendu
tenth:dixième
terrific:formidable
that:que
the:l'
theater:théâtre
theatre:théâtre
they:ils une
thimble:dé à coudre
thing:chose
thinker:penseur
third:troisième
thought:pensée
thread:fil
threat:menace
throne:trône
through:par
thud:bruit sourd
thug:voyou
tiara:diadème
tick:coche
ticket:billet
tie:cravate
tight:virage serré
till:caisse
time:temps
timer:temporisateur
times:fois
tin:boîte de conserve
tingle:picotement
tiny:petit
tip:pointe
title:titre
to:de
toddle:trottiner
toddler:bambin
toil:labeur
toilet:toilette
toll:péage
tomato:tomate
tomboy:garçon manqué
ton:tonne
too:trop
tool:outil
toothache:mal de dents
toothpaste:dentifrice
top:haut
tote:fourre-tout
touch:touche
tough:dur
tour:tournée
tourist:touriste
tournament:tournoi
tower:tour
toy:jouet
track:piste
tractor:tracteur
trade:commerce
trail:sentier
trailer:remorque
trainer:entraîneur
training:formation
traitors:traîtres
tramp:clochard
transcript:transcription
translation:traduction
trap:piège
trash:poubelle
travel:voyage
travelling:déplacement
tray:plateau
treat:régal
treatment:traitement
tree:arbre
tremendous:formidable
trend:tendance
tribute:hommage
trick:astuce
trickle:filet
trier:juge
trigger:gâchette
trill:trille
trim:garniture
trip:voyage
trolley:chariot
trough:auge
trowel:truelle
true:vrai
trumpet:trompette
tuck:repli
tuna:thon
turkey:dinde
tuxedo:smoking
twill:armure
twin:jumeau
tyre:pneu
umbrella:parapluie
uncle:oncle
undeniable:indéniable
unincorporated:fiducie
unknown:inconnue
unspecified:non précisée
unusual:inhabituelle
urge:envie
urn:urne
vacation:vacances
vagrant:vagabond
value:valeur
van:camionnette
varnish:vernis
vector:vecteur
vehicle:véhicule
veil:voile
venue:lieu
very:très
vest:gilet
vet:vétérinaire
victim:victime
video:vidéo
vigilante:justicier
vinegar:vinaigre
virgin:vierge
virginity:virginité
vise:étau
visit:visite
visitor:visiteur
voluntary:volontaire
volunteer:bénévole
voucher:bon de réduction
vows:voeux
wait:attente
waiter:serveur
wake:sillage
walking:pied
walkout:débrayage
walkover:promenade de santé
wall:paroi
wallet:portefeuille
wallflower:giroflée
wallflowers:giroflées
walnut:noix
wan:réseau WAN
wanderer:vagabond
wank:branlette
want:manque
wanted:recherche
war:guerre
wardrobe:garde-robe
warrant:mandat
warrior:guerrier
wash:lavage
washout:lavage
wasp:guêpe
waste:déchet
watch:montre
water:eau
waver:vaciller
wax:cire
way:moyen
weak:faible
weave:tissage
web:bande
wedding:mariage
week:semaine
weirdo:cinglé
welcome:accueil
well:puits
whale:baleine
wheel:roue
wheelwright:charron
whiff:bouffée
while:quelque temps
whip:fouet
whiplash:coup de fouet
whit:d'iota
white:blanc
who:qui
whole:ensemble
wholes:totalités
whore:pute
wide:vaste
wider:plus large
widow:veuve
wig:perruque
will:volonté
wily:rusé
wimp:mauviette
wincing:grimace
wind:vent
window:fenêtre
windscreen:pare-brise
wipe:lingette
wish:souhait
withdraw:retrait
without:sans
woman:femme
wood:bois
wooden:bois
word:mot
work:travail
workbook:classeur
works:usine
worksheet:feuille de calcul
workshop:atelier
worm:ver
wound:plaie
wounded:blessé
wreck:épave
wrench:clé
wrinkle:ride
writ:bref
writer:écrivain
written:écrit
wrong:mauvaise
zebra:zèbre
zipper:fermeture à glissière
zookeeper:gardien de zoo
